import pandas as pd
import numpy as np

data = {
   'Дата': ['03.01.25','06.01.25', '08.01.25','09.01.25','10.01.25',
            '13.01.25','14.01.25','15.01.25','16.01.25','17.01.25',
            '20.01.25','1.01.25','22.01.25','23.01.25','24.01.25','27.01.25','28.01.25'],
    'Купон': [8.67,8.74,8.55,8.26,8.16,8.2,8.11,8.0,8.16,8.2,8.11,8.11,8.11,8.18,8.23,8.17,9.12],
    'Цена': [78.24,78.2,78.37,77.92,78.22,78.16,77.97,78.18,78.47,78.38,77.7,77.55,77.61,78.06,
             78.07,78.05,77.22]
}


df = pd.DataFrame(data)
print(df)
#создаем корелляционную матрицу
correliation = df[['Купон', 'Цена']].corr(method='pearson')
print(correliation)
#делаем выборку из таблицы, чтобы провести описательный анализ
selected_data = df[['Дата', 'Цена']]

print(selected_data)
#делаем описательный анализ только цены
print(selected_data.describe())
#делаем описательный анализ всех столбцов
print(df.describe(include='all'))
#делаем описательный анализ только столбцов с числовыми данными
print(df.describe(include=[np.number]))
#делаем описательный анализ всех кроме столбцов с числовыми данными
print(df.describe(exclude=[np.number]))
#делаем описательный анализ только столбцов с типом object 
print(df.describe(include=[object]))
#проверяем типы данных
print(df.dtypes)



